// MIT License
//
// Copyright (c) 2023 FAST8.RU
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all
// copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

#Область СлужебныйПрограммныйИнтерфейс

Процедура fast8DS_ПодпискаВыборБизнесПроцессОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// Обработка представления бизнес-процесса и разбор внутренней навигационной ссылки и уникального идентификатора
	fast8DS_ОбработкаПолученияДанныхВыбора.ОбработатьПредставлениеДокументаБизнесПроцесса("БизнесПроцесс", Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры // fast8DS_ПодпискаВыборБизнесПроцессОбработкаПолученияДанныхВыбора()

Процедура fast8DS_ПодпискаВыборДокументыОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// Обработка представления документа и разбор внутренней навигационной ссылки и уникального идентификатора
	fast8DS_ОбработкаПолученияДанныхВыбора.ОбработатьПредставлениеДокументаБизнесПроцесса("Документ", Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры // fast8DS_ПодпискаВыборДокументыОбработкаПолученияДанныхВыбора()

Процедура fast8DS_ПодпискаВыборЗадачаОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// Обработка представления задачи и разбор внутренней навигационной ссылки и уникального идентификатора
	fast8DS_ОбработкаПолученияДанныхВыбора.ОбработатьПредставлениеЗадачи(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры // fast8DS_ПодпискаВыборЗадачаОбработкаПолученияДанныхВыбора()

Процедура fast8DS_ПодпискаВыборПланВидовРасчетаОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// Разбор внутренней навигационной ссылки и уникального идентификатора
	fast8DS_ОбработкаПолученияДанныхВыбора.ОбработатьНавигационнуюСсылкуИУникальныйИдентификатор("ПланВидовРасчета", Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры // fast8DS_ПодпискаВыборПланВидовРасчетаОбработкаПолученияДанныхВыбора()

Процедура fast8DS_ПодпискаВыборПланВидовХарактеристикОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// Разбор внутренней навигационной ссылки и уникального идентификатора
	fast8DS_ОбработкаПолученияДанныхВыбора.ОбработатьНавигационнуюСсылкуИУникальныйИдентификатор("ПланВидовХарактеристик", Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры // fast8DS_ПодпискаВыборПланВидовХарактеристикОбработкаПолученияДанныхВыбора()

Процедура fast8DS_ПодпискаВыборПланСчетовОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// Разбор внутренней навигационной ссылки и уникального идентификатора
	fast8DS_ОбработкаПолученияДанныхВыбора.ОбработатьНавигационнуюСсылкуИУникальныйИдентификатор("ПланСчетов", Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры // fast8DS_ПодпискаВыборПланСчетовОбработкаПолученияДанныхВыбора()

Процедура fast8DS_ПодпискаВыборСправочникиОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// Разбор внутренней навигационной ссылки и уникального идентификатора
	fast8DS_ОбработкаПолученияДанныхВыбора.ОбработатьНавигационнуюСсылкуИУникальныйИдентификатор("Справочник", Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры // fast8DS_ПодпискаВыборСправочникиОбработкаПолученияДанныхВыбора()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
